Repository: MRezaKarimi/igsaver
Catalog: lib/l10n/app_*.arb
Languages: fa

source: Paste Link Here
fa: لینک را وارد کنید

# usernameInputHint
source: username without @
fa: نام کاربری بدون @

source: Search
fa: جستجو

source: Download Profile
fa: دانلود پروفایل

source: History
fa: تاریخچه

source: Settings
fa: تنظیمات

source: Select Posts
fa: انتخاب پست ها

source: Download All
fa: دانلود همه

source: Post Selected
fa: پست انتخاب شده

source: Download Selected
fa: دانلود انتخاب شده ها

source: Download All Posts
fa: دانلود همه پست ها

source: download Images Only
fa: دانلود عکس ها

source: Download Profile Posts
fa: دانلود پست های پروفایل

source: Save To Gallery
fa: ذخیره در گالری

source: Posts
fa: پست

source: Followers
fa: فالوور

source: Watch Clipboard
fa: پایش کلیپ بورد

# watchClipboardDesc
source: Automatically download post when URL copied to the clipboard. Only works in Android 9 and below. Restart required if changed.
fa: هنگامی که URL جدید کپی شد، بصورت خودکار دانلود را شروع کن. این ویژگی تنها در اندروید 9 و قبل از آن کار می کند.

source: Only Download Images
fa: فقط دانلود تصاویر

# onlyDownloadImagesDesc
source: Skip downloading videos when new url copied to the clipboard. Turning this off, results in more data usage.
fa: در صورت فعال بودن این گزینه، فقط تصاویر بصورت خودکار دانلود می شوند و ویدیو ها نادیده گرفته می شوند.

source: Show Notification
fa: نمایش اعلان

# showNotificationDesc
source: Show notification when download completed.
fa: بعد از اتمام دانلود، اعلان مربوطه نمایش داده شود.

source: Account is private
fa: حساب کاربری خصوصی است

source: Account has no post
fa: حساب کاربری هیچ پستی ندارد

source: User Not Found!
fa: حساب کاربری یافت نشد!

source: No Internet Connection
fa: اتصال اینترنت برقرار نیست

# noInternetConnectionMessage
source: Make sure your device is connected to the network and try again.
fa: مطمئن شوید که دستگاهتان به اینترنت متصل است و دوباره امتحان کنید.

# unknownError
source: Oops! Something went wrong!
fa: متاسفم! خطایی رخ داد

# unknownErrorMessage
source: Disconnect your VPN and try again.
fa: مطمئن شوید که VPN غیرفعال است و دوباره امتحان کنید.

source: Invalid URL
fa: لینک نامعتبر است

# invalidURLMessage
source: The given URL is not a valid instagram URL.
fa: لینک داده شده یک URL معتبر اینستاگرام نیست.

source: Post Not Found!
fa: پست یافت نشد!

# postNotFoundMessage
source: URL is broken or post belongs to a private account.
fa: لینک خراب است یا متعلق به یک حساب کاربری خصوصی است.

# storagePermission
source: Storage Permission Denied
fa: دسترسی به حافظه رد شد

# storagePermissionMessage
source: This app needs storage permission to work. Go to your device's settings and grant permission.
fa: این برنامه برای کارکردن نیاز به مجوز دسترسی به حافظه دارد. به تنظیمات رفته و مجوز حافظه برای این برنامه را فعال کنید.

# unexpectedError
source: An Unexpected Error Occurred
fa: یک خظای غیرمنتظره رخ داد

source: Loading Images
fa: در حال بارگیری تصاویر

source: Loading Data
fa: در حال بارگیری داده ها
